<template>
  <div class="col">
    <h3>Вопроcно-ответная система с использованием семантических технологий</h3>
    <p>Вопроcно-ответная система, отвечающая на вопросы о географических объектах. Использует базу знаний Wikidata и язык SPARQL для извлечения знаний.</p>

    <p>Frontend-часть написана на Vue.js, Backend на Python Flask. Язык Python выбран из-за большого инструментария в области обработки естевенных языков(NLTK, pymorphy2).</p>

    <p>Поддерживаемые на данный момент темы вопросов (система знает 203 страны): </p>
    <ul>
      <li>Валюта</li>
      <li>Президент (глава государства)</li>
      <li>Официальный язык</li>
      <li>Столица</li>
      <li>Административное деление</li>
    </ul>
    <p>Например: </p>
    <ul>
      <li>Какая валюта в Швеции</li>
      <li>Кто президент США</li>
      <li>Государственный язык в Греции</li>
      <li>Столица Японии</li>
      <li>Административное деление Великобритании</li>
    </ul>

  </div>
</template>

<script>

export default {
  name: "manual",
  data() {
    return {
      
    };
  },
  methods: {
    
  },
  mounted() {
    
  }
};
</script>

<style>
.list {
  text-align: left;
  max-width: 750px;
  margin: auto;
}
</style>
